<a href="https://colab.research.google.com/github/valenja9/Python_krouzek_pro_dospele/blob/main/Python_pro_dospele_II_IX.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import csv
header = ['Surname', 'Name', 'Full Name', 'Age', 'City', 'Job', 'Gender']
data = [['Smith', 'John', 'Smith, John', '32', 'London', 'Programmer', ''],
        ['Doe', 'Joe', 'Doe, Joe', '34', 'Liverpool', '', 'Male'],
        ['Murphy', 'Ann', 'Murphy, Ann', '29', 'London', 'Admin', 'Female'],
        ['Cook', 'Floyd', 'Cook, Floyd', '28', '', 'Tester', 'Male'],
        ['Glenn', 'Taylor', 'Glenn, Taylor', '35', 'Birmingham', 'Manager', 'Female'],
        ['Mills', 'Amanda', 'Mills, Amanda', '41', 'Leicester', 'Quality Assurance', 'Female']]

In [3]:
with open("example.csv", mode="w", encoding="utf-8") as f:
   f_writer = csv.writer(f)
   f_writer.writerow(header)
   f_writer.writerows(data)
   print("Vytvoril jsem soubor se jmenem: example.csv")

In [9]:
with open("example.csv", mode="r", newline="", encoding="utf-8") as f:
   d_reader = csv.DictReader(f)
   for d in d_reader:
    print(dict(d)["Surname"])

Smith
Doe
Murphy
Cook
Glenn
Mills

In [10]:
dict1 = {'Job': 'Programmer', 'Age': 38, 'Full Name': 'Galagher, Fred', 'City': 'London', 'Surname': 'Galagher', 'Gender': 'Male', 'Name': 'Fred'}
header = ['Surname', 'Name', 'Full Name', 'Age', 'City', 'Job', 'Gender']

In [11]:
with open("novy_file.csv", mode="w", newline="", encoding="utf-8") as f:
  writer = csv.DictWriter(f, header)
  writer.writeheader()
  writer.writerow(dict1)

SQL

In [13]:
import sqlite3
import pandas as pd

In [12]:
houses = [
    (1, 'first', 110, 4, 1, 100000),
    (2, 'second', 90, 3, 0, 65000),
    (3, 'second', 90, 3, 1, 72000)
]

In [14]:
dir(sqlite3)

['Binary',
 'Cache',
 'Connection',
 'Cursor',
 'DataError',
 'DatabaseError',
 'Date',
 'DateFromTicks',
 'Error',
 'IntegrityError',
 'InterfaceError',
 'InternalError',
 'NotSupportedError',
 'OperationalError',
 'OptimizedUnicode',
 'PARSE_COLNAMES',
 'PARSE_DECLTYPES',
 'PrepareProtocol',
 'ProgrammingError',
 'Row',
 'SQLITE_ALTER_TABLE',
 'SQLITE_ANALYZE',
 'SQLITE_ATTACH',
 'SQLITE_CREATE_INDEX',
 'SQLITE_CREATE_TABLE',
 'SQLITE_CREATE_TEMP_INDEX',
 'SQLITE_CREATE_TEMP_TABLE',
 'SQLITE_CREATE_TEMP_TRIGGER',
 'SQLITE_CREATE_TEMP_VIEW',
 'SQLITE_CREATE_TRIGGER',
 'SQLITE_CREATE_VIEW',
 'SQLITE_CREATE_VTABLE',
 'SQLITE_DELETE',
 'SQLITE_DENY',
 'SQLITE_DETACH',
 'SQLITE_DONE',
 'SQLITE_DROP_INDEX',
 'SQLITE_DROP_TABLE',
 'SQLITE_DROP_TEMP_INDEX',
 'SQLITE_DROP_TEMP_TABLE',
 'SQLITE_DROP_TEMP_TRIGGER',
 'SQLITE_DROP_TEMP_VIEW',
 'SQLITE_DROP_TRIGGER',
 'SQLITE_DROP_VIEW',
 'SQLITE_DROP_VTABLE',
 'SQLITE_FUNCTION',
 'SQLITE_IGNORE',
 'SQLITE_INSERT',
 'SQLITE_OK',
 'SQLITE_PRAGMA',
 'SQLITE_READ',
 'SQLITE_RECURSIVE',
 'SQLITE_REINDEX',
 'SQLITE_SAVEPOINT',
 'SQLITE_SELECT',
 'SQLITE_TRANSACTION',
 'SQLITE_UPDATE',
 'Statement',
 'Time',
 'TimeFromTicks',
 'Timestamp',
 'TimestampFromTicks',
 'Warning',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 'adapt',
 'adapters',
 'apilevel',
 'collections',
 'complete_statement',
 'connect',
 'converters',
 'datetime',
 'dbapi2',
 'enable_callback_tracebacks',
 'enable_shared_cache',
 'paramstyle',
 'register_adapter',
 'register_converter',
 'sqlite_version',
 'sqlite_version_info',
 'threadsafety',
 'time',
 'version',
 'version_info']

- 1) create
- 2) insert - values
- 3) select
- https://biportal.cz/sql-group-by/

In [16]:
with sqlite3.connect("ex.db") as conn: 
  cursor = conn.cursor()
  fields = "id, street, size, number_of_rooms, parking, price" #Hlavicka 
  query = f"create TABLE HOME_PRICES ({fields})" #prikaz, pozor na nutnost kulatych zavorek
  cursor.execute(query)
  cursor.executemany("insert into HOME_PRICES values (?, ?, ?, ?, ?, ?)", houses)

In [18]:
with sqlite3.connect("ex.db") as conn:
  df = pd.read_sql("select * from HOME_PRICES", conn)
df

   id  street  size  number_of_rooms  parking   price
0   1   first   110                4        1  100000
1   2  second    90                3        0   65000
2   3  second    90                3        1   72000

In [19]:
with sqlite3.connect("ex.db") as conn:
  df = pd.read_sql("select * from HOME_PRICES where price  < 73000", conn)
df

   id  street  size  number_of_rooms  parking  price
0   2  second    90                3        0  65000
1   3  second    90                3        1  72000

In [20]:
with sqlite3.connect("ex.db") as conn:
  df = pd.read_sql("select street, size, price from HOME_PRICES where price  < 73000", conn)
df

   street  size  price
0  second    90  65000
1  second    90  72000

In [25]:
hlavicka = ['Surname', 'Name', 'Full Name', 'Age', 'City', 'Job', 'Gender']
obsah = [['Smith', 'John', 'Smith, John', '32', 'London', 'Programmer', ''],
        ['Doe', 'Joe', 'Doe, Joe', '34', 'Liverpool', '', 'Male'],
        ['Murphy', 'Ann', 'Murphy, Ann', '29', 'London', 'Admin', 'Female'],
        ['Cook', 'Floyd', 'Cook, Floyd', '28', '', 'Tester', 'Male'],
        ['Glenn', 'Taylor', 'Glenn, Taylor', '35', 'Birmingham', 'Manager', 'Female'],
        ['Mills', 'Amanda', 'Mills, Amanda', '41', 'Leicester', 'Quality Assurance', 'Female']]

In [22]:
"("+ "?, " * (len(hlavicka) - 1) + "?)"

'(?, ?, ?, ?, ?, ?, ?)'

In [23]:
", ".join(['Mills', 'Amanda', 'Mills, Amanda', '41', 'Leicester', 'Quality Assurance', 'Female'])

'Mills, Amanda, Mills, Amanda, 41, Leicester, Quality Assurance, Female'

In [36]:
def vytvoreni_databaze(jmeno_databaze: str, hlavicka: list, data: list) -> None:
  with sqlite3.connect(f"{jmeno_databaze}.db") as conn:
    kurzor = conn.cursor()
    jmena_sloupecku = ", ".join(hlavicka)
    jmeno_tabulky = jmeno_databaze.upper()
    pocet_sloupcu = "("+ "?, " * (len(hlavicka) - 1) + "?)"
    prikaz = f"create TABLE {jmeno_tabulky} ({jmena_sloupecku})"
    kurzor.execute(prikaz)
    kurzor.executemany(f"insert into {jmeno_tabulky}  values {pocet_sloupcu}", data)

In [38]:
vytvoreni_databaze("pokusIII", hlavicka, obsah)

In [39]:
with sqlite3.connect("pokusIII.db") as conn:
  df = pd.read_sql("SELECT * FROM POKUSIII ORDER BY age", conn)
df

  Surname    Name           Full Age        City                Job  Gender
0    Cook   Floyd    Cook, Floyd  28                         Tester    Male
1  Murphy     Ann    Murphy, Ann  29      London              Admin  Female
2   Smith    John    Smith, John  32      London         Programmer
3     Doe     Joe       Doe, Joe  34   Liverpool                       Male
4   Glenn  Taylor  Glenn, Taylor  35  Birmingham            Manager  Female
5   Mills  Amanda  Mills, Amanda  41   Leicester  Quality Assurance  Female

In [40]:
df.to_csv("tabulka.csv")

In [41]:
df.to_json("j.json")